import { Injectable } from "@angular/core";

@Injectable()
export class DataList {

 lawsuit_type =[ // نوع الدعوى
    {no: 1, name: "حقوق مالية"},
    {no: 2, name:"تصريحية/تصحيح قيد"},
    {no: 3, name: "اثبات/ابطال/الغاء/فسخ (قيد، سند، تسجيل، شيكات، عقد، وكالة)، تحكيم"},
    {no: 4, name: "أراضي"},
    {no: 5, name: "تعويض /حادث طرق/أخطاء طبية/أخطاء أخرى"},
    {no: 6, name: "إزالة تعدي /تصحيح حدود"},
    {no: 7, name: "حقوق عمالية وتعويض إصابات عمل"},
    {no: 8, name: "ازالة ضرر/إزالة خصومة"},
    {no: 9, name: "نزع يد/رفع يد/وضع يد/إعادة حال سابق "},
    {no: 10, name: "تقسيم أموال مشتركة/فرز وتجنيب/إزالة شيوع"},
    {no: 11, name: "استرداد/حيازة/منع تعرض/وقف الأعمال الجديدة"},
    {no: 12, name: "اعتراض الغير"},
    {no: 13, name: "أولوية"},
    {no: 14, name: "حقوق ارتفاق مرور، أجزاء مشتركة"},
    {no: 15, name: "تنفيذ عيني"},
    {no: 16, name: "اخلاء ماجور"},
    {no: 17, name: "تنفيذ (عقد، التزامات، معاملة)"},
    {no: 18, name: "استرداد عارية"},
    {no: 19, name: "دعوى تزوير أصلية"},
    {no: 20, name: "دعوى هبة"},
    {no: 21, name: "اثبات وفاء"},
    {no: 22, name: "دعوى شفعة"},
    {no: 23, name: "إعادة محاكمة"},
    {no: 24, name: "دعوى استحقاق عقار/إجراء محاسبة/إلغاء تسجيل إعادة قيد"},
    {no: 25, name: "أخرى"},
 ];

stage = [  //المراحل
    {no:1 , name: "مرحلة تبليغ الأطراف"},
    {no:2 , name: "مرحلة تقديم بيانات المدعي"},
    {no:3 , name: "مرحلة تقديم بيانات المدعى عليه"},
    {no:4 , name: "اقفال باب المرافعة"},
    {no:5 , name: "فتح باب المرافعة"},
    {no:6 , name: "اقفال باب المرافعة والحجز للحكم"},
];

postponementPeriodList = [
  {name:'claimant' , value:' المدعي او وكيله' },
  {name:'defendant' , value:'المدعى عليه او وكيله' },
  {name:'hea' , value:'القاضي / الهيئة القضائية' },
  {name:'khabeer' , value:'الخبير' },
  {name:'witness' , value:'الشهود' },
  {name:'notes' , value:'التبيلغات' },
  {name:'corona' , value:'جائحة_كورونا' },
  {name:'daily' , value:'تأجيل_إداري' },
  {name:'award' , value:'عوارض_الخصومة' },
  {name:'file' , value:'حركة الملف' },
]

claimant = [//المدعى
    {no: 1 ,  name: "عدم حضور المدعي أو وكيله"},
    {no: 2 ,  name: "السماح لتقديم بينات"},
    {no: 3 ,  name: "استكمال تقديم البينات"},
    {no: 4 ,  name: "عدم القدرة على تقديم البينات"},
    {no: 5 ,  name: "طلب توكيل محامي"},
    {no: 6 ,  name: "طلب تغيير محامي"},
    {no: 7 ,  name: "تأجيل الجلسة بناء على طلبه"},
    {no: 8 ,  name: "تعديل لائحة الدعوى"},
    {no: 9 ,  name: "للاطلاع على مبرزات المدعى عليه"},
    {no: 10 , name: "المحامي ليس له صفة في الدعوى"},
    {no: 11 , name: "طلبات الإدخال والتدخل"},
    {no: 12 , name: "نظر الطلب"},
    {no: 13 , name: "التأجيل أملاً في المصالحة"},
    {no: 14 , name: "أخرى"},
];


defendant = [ //المدعى_عليه
    {no: 1 , name: "عدم حضور المدعى عليه أو وكيله" },
    {no: 2,  name: "السماح لتقديم بينات" },
    {no: 3,  name: "استكمال تقديم البينات" },
    {no: 4,  name: "عدم القدرة على تقديم البينات" },
    {no: 5,  name: "طلب توكيل محامي" },
    {no: 6,  name: "طلب تغيير محامي" },
    {no: 7,  name: "تأجيل الجلسة بناء على طلبه" },
    {no: 8,  name: "تقديم لائحة جوابية" },
    {no: 9,  name: "للاطلاع على مبرزات المدعي" },
    {no: 10, name: "المحامي ليس له صفة في الدعوى" },
    {no: 11, name: "طلبات الإدخال والتدخل" },
    {no: 12, name: "نظر الطلب" },
    {no: 13, name: "التأجيل أملاً في المصالحة" },
    {no: 14, name: "أخرى" },
];


hea = [
    //الهيئة_القضائية
    {no: 1,  name: "غياب القاضي /عدم اكتمال الهيئة القضائية"},
    {no: 2,  name: "طلب القاضي رأي خبير"},
    {no: 3,  name: "التأجيل أملاً في الصلح (عرض القاضي للصلح)"},
    {no: 4,  name: "تأجيل الجلسة للقرار في الدفوع"},
    {no: 5,  name: "عدم الاختصاص في نطاق معين من الدعوى"},
    {no: 6,  name: "تنحي القاضي"},
    {no: 7,  name: "فتح باب المرافعة"},
    {no: 8,  name: "سماع البينات"},
    {no: 9,  name: "عدم كفاية وقت المحكمة"},
    {no: 10, name: "الدراسة والحجز للحكم"},
    {no: 11, name: "تعديل لائحة الدعوى"},
    {no: 12, name: "عدم احضار ملف الدعوى"},
    {no: 13, name: "قرار المحكمة بإدخال خصوم للدعوى من تلقاء نفسها"},
    {no: 14, name: "أخرى"},
];

khabeer = [//الخبير
    {no: 1, name: "عدم حضور الخبير"},
    {no: 2, name: "تأخر الخبير في تسليم تقريره"},
    {no: 3, name: "عدم حلف الخبير لليمين"},
    {no: 4, name: "أخرى"},
];

witness=[ //الشهود
    {no:1, name: "عدم حضور الشاهد"},
    // {no:2, name: "طلب مزيد من الشهود"},
    {no:3, name: "أخرى"},
];

notes = [//التبيلغات
    {no:1, name: "عدم تبليغ المدعي أو وكيله" },
    {no:2, name: "عدم تبليغ المدعى عليه أو وكيله" },
    {no:3, name: "تأخر تبليغ الخبير" },
    {no:4, name: "تأخر تبليغ الشهود" },
    {no:5, name: "أخرى" },
];


corona= [//جائحة_كورونا
    {no:1, name: "الفترة الاستثنائية"},
    {no:2, name: "الإغلاق / إغلاق محكمة بسبب جائحة كورونا"},
    {no:3, name: "أخرى"},
];

daily = [//تأجيل_إداري
    {no:1, name: "إضراب"},
    {no:2, name: "أحوال جوية"},
    {no:3, name: "عطلة رسمية"},
    {no:4, name: "الاحتلال 'عدوان'"},
    {no:5, name: "دورات تدريبية"},
    {no:6, name: "أخرى"},
];

award =  [//عوارض_الخصومة
    {no:1, name: "التأجيل العام"},
    {no:2, name: "الشطب "},
    {no:3, name: "وفاة أحد الخصوم أو فقدان أهلية"},
    {no:4, name: "استئناف/طعن الطلبات الفرعية "},
    {no:5, name: "وقف الخصومة (وجود دعوى أخرى متعلقة بالدعوى)"},
    {no:6, name: "أخرى"},
];

file =  [//عوارض_الخصومة
    {no:1, name: "عدم إعادة الملف من محكمة الاستئناف "},
    {no:2, name: "عدم إعادة الملف من محكمة النقض"},
    {no:3, name: "عدم وجود الملف"},
];

court_name = [ //اسم المحكمة
  {no: 1, name: 'بداية غزة'},
  {no: 2, name: 'بداية خانيونس'},
  {no: 3, name: 'بداية دير البلح'},
  {no: 4, name: 'بداية شمال غزة'},
  {no: 5, name: 'بداية رفح'},
  {no: 6, name: 'صلح غزة'},
  {no: 7, name: 'صلح خانيونس'},
  {no: 8, name: 'صلح دير البلح'},
  {no: 9, name: 'صلح شمال غزة'},
  {no: 10, name: 'صلح رفح'},
]

}
